Here we go, updated test:

```golang
func TestAccGitlabProject_withContainer(t *testing.T) {
	var received gitlab.Project
	rInt := acctest.RandInt()

	resource.ParallelTest(t, resource.TestCase{
		ProviderFactories: providerFactories,
		CheckDestroy:      testAccCheckGitlabProjectDestroy,
		Steps: []resource.TestStep{
			{
				Config: fmt.Sprintf(`
					resource "gitlab_project" "this" {
						name = "foo-%d"
						path = "test"
						visibility_level = "public"
					}`, rInt),
				Check: resource.ComposeTestCheckFunc(
					testAccCheckGitlabProjectExists("gitlab_project.this", &received),
					func(s *terraform.State) error {
						exec.Command("/usr/bin/docker login -u root --password ACCTEST1234567890123 localhost:5050").Run()
						exec.Command("/usr/bin/docker pull alpine").Run()
						path := fmt.Sprintf("localhost:5050/%s", received.PathWithNamespace)
						exec.Command(fmt.Sprintf("/usr/bin/docker tag alpine %s", path)).Run()
						exec.Command(fmt.Sprintf("/usr/bin/docker push %s", path)).Run()
						return nil
					},
				),
			},
			// Change Name
			{
				Config: fmt.Sprintf(`
				resource "gitlab_project" "this" {
					name = "foo-%d"
					path = "test-change"
					visibility_level = "public"
				}`, rInt),
				Check: resource.ComposeTestCheckFunc(
					func(s *terraform.State) error {
						log.Println("stuff")
						return nil
					},
				),
			},
		},
	})
}
```

Result: _test fails properly, with the path not changing in GitLab_:

```
--- FAIL: TestAccGitlabProject_withContainer (47.21s)
    resource_gitlab_project_test.go:30: Step 2/2 error: After applying this test step, the plan was not empty.
        stdout:
        
        
        An execution plan has been generated and is shown below.
        Resource actions are indicated with the following symbols:
          ~ update in-place
        
        Terraform will perform the following actions:
        
          # gitlab_project.this will be updated in-place
          ~ resource "gitlab_project" "this" {
                allow_merge_on_skipped_pipeline                  = false
                analytics_access_level                           = "enabled"
                approvals_before_merge                           = 0
                archived                                         = false
                auto_cancel_pending_pipelines                    = "enabled"
                auto_devops_deploy_strategy                      = "continuous"
                auto_devops_enabled                              = true
                autoclose_referenced_issues                      = true
                build_git_strategy                               = "fetch"
                build_timeout                                    = 3600
                builds_access_level                              = "enabled"
                ci_default_git_depth                             = 20
                ci_forward_deployment_enabled                    = true
                container_registry_access_level                  = "enabled"
                container_registry_enabled                       = true
                default_branch                                   = "main"
                emails_disabled                                  = false
                forking_access_level                             = "enabled"
              ~ http_url_to_repo                                 = "http://gitlab/root/test.git" -> (known after apply)
                id                                               = "13"
                issues_access_level                              = "enabled"
                issues_enabled                                   = true
                lfs_enabled                                      = true
                merge_method                                     = "merge"
                merge_pipelines_enabled                          = false
                merge_requests_access_level                      = "enabled"
                merge_requests_enabled                           = true
                merge_trains_enabled                             = false
                mirror                                           = false
                mirror_overwrites_diverged_branches              = false
                mirror_trigger_builds                            = false
                name                                             = "foo-1817053023237789349"
                namespace_id                                     = 1
                only_allow_merge_if_all_discussions_are_resolved = false
                only_allow_merge_if_pipeline_succeeds            = false
                only_mirror_protected_branches                   = false
                operations_access_level                          = "enabled"
                packages_enabled                                 = true
                pages_access_level                               = "private"
              ~ path                                             = "test" -> "test-change"
              ~ path_with_namespace                              = "root/test" -> (known after apply)
                pipelines_enabled                                = true
                printing_merge_request_link_enabled              = true
                public_builds                                    = false
                remove_source_branch_after_merge                 = false
                repository_access_level                          = "enabled"
                repository_storage                               = "default"
                request_access_enabled                           = true
                resolve_outdated_diff_discussions                = false
                runners_token                                    = (sensitive value)
                security_and_compliance_access_level             = "private"
                shared_runners_enabled                           = false
                snippets_access_level                            = "enabled"
                snippets_enabled                                 = true
                squash_option                                    = "default_off"
              ~ ssh_url_to_repo                                  = "git@gitlab:root/test.git" -> (known after apply)
                tags                                             = []
                topics                                           = []
                visibility_level                                 = "public"
              ~ web_url                                          = "http://gitlab/root/test" -> (known after apply)
                wiki_access_level                                = "enabled"
                wiki_enabled                                     = true
        
                container_expiration_policy {
                    cadence     = "1d"
                    enabled     = false
                    keep_n      = 10
                    next_run_at = "2022-08-01T02:58:07Z"
                    older_than  = "90d"
                }
            }
        
        Plan: 0 to add, 1 to change, 0 to destroy.
FAIL
```
